public/man/man1/lprm.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - lprm.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - lprm.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>lprm - cancel print jobs</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>lprm</strong> [ <strong>-h */hostname/[</strong>:*/port/] ] [ <strong>-E</strong> ] [ <strong>-U</strong> <em>username</em> ] [
<strong>-P</strong> <em>destination</em>[//instance/] ] [ <strong>-</strong> ] [ <em>job-id(s)</em> ]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>lprm</strong> cancels print jobs that have been queued for printing. If no
arguments are supplied, the current job on the default destination is
canceled. You can specify one or more job ID numbers to cancel those
jobs or use the <em>-</em> option to cancel all jobs.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The <strong>lprm</strong> command supports the following options:</p>
<dl>
<dt>
<strong>-E</strong>
</dt>
<dd>Forces encryption when connecting to the server.</dd>
<dt>
*-P */destination/[//instance/]
</dt>
<dd>Specifies the destination printer
or class.</dd>
<dt>
*-U */username/
</dt>
<dd>Specifies an alternate username.</dd>
<dt>
*-h */server/[/:port/]
</dt>
<dd>Specifies an alternate server. Note: This
option must occur before all others.</dd>
</dl>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
CONFORMING TO
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>The CUPS version of <strong>lprm</strong> is compatible with the standard Berkeley
command of the same name.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
EXAMPLES
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>Cancel the current job on the default printer:</p>
<pre class="example">
    lprm
</pre>
<p>
Cancel job 1234:</p>
<pre class="example">
    lprm 1234
</pre>
<p>
Cancel all jobs:</p>
<pre class="example">
    lprm -
</pre>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
SEE ALSO
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>*cancel*(1), *lp*(1), *lpq*(1), *lpr*(1), *lpstat*(1), CUPS Online Help
(<a href="http://localhost:631/help)">http://localhost:631/help)</a></p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
COPYRIGHT
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>Copyright © 2020-2024 by OpenPrinting.</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
